delete Potters_Patrol.dbo.Books
INSERT INTO Potters_Patrol.dbo.Books(BookId, Book_Name, Book_description,Book_url,Book_Image) 
SELECT 1,'Гаррі Поттер і філософський камінь','Це перша книга про Гаррі Поттера. 
Відірвавшись від комп"ютерів і телеекранів, 
сотні мільйонів дітей та дорослих у всьому світі ЗНОВУ ЧИТАЮТЬ! 
Такого успіху не знала жодна художня книга. Казка про хлопчика-чарівника Гаррі Поттера 
зачарувала всю планету...
Першу книжку про Гаррі Поттера «А-БА-БА-ГА-ЛА-МА-ГА» презентувала в ніч з 13 на 14 квітня 2002 року. 
То було грандіозне шоу на нічному Хрещатику, на яке зібралося більше тисячі людей з дітьми. 
Ось цитата з «Книжкового огляду»: — У ніч з 13 на 14 квітня пересічні кияни і гості столиці 
могли спостерігати справжнє диво: справді, де ще зараз в Україні можна зустріти велику чергу? 
Та ще й опівночі? І не просто чергу, а чергу за книгою? За україномовною книгою? 
Таке може бути лише тоді, коли до справи береться Іван Малкович та його видавництво 
«А-БА-БА-ГА-ЛА-МА-ГА»...','https://fantasy-worlds.net/lib/id4588/',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp1.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Books(BookId, Book_Name, Book_description,Book_url,Book_Image) 
SELECT 2,'Гаррі Поттер і таємна кімната','Це друга книга про пригоди Гаррі Поттера. 
Він знову вступає у відчайдушну сутичку зі злом. 
Проте цього разу ворог такий сильний, що надії на перемогу майже немає...
«Гаррі Поттер і таємна кімната» (англ. «Harry Potter and the Chamber of Secrets») — 
другий роман серії «Гаррі Поттер», написаний Дж. К. Роулінґ. 
Опублікований 2 липня 1998 року видавництвом «Блумсбері Паблішинґ» у Лондоні. 
У 2002 році на основі роману знято однойменний художній фільм. 
Українською мовою роман перекладений Віктором Морозовим і опублікований видавництвом 
«А-БА-БА-ГА-ЛА-МА-ГА» 2 травня 2002 року.','https://fantasy-worlds.net/lib/id4590/',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp2.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Books(BookId, Book_Name, Book_description,Book_url,Book_Image) 
SELECT 3,'Гаррі Поттер і в"язень Азкабану','«Гаррі Поттер і в"язень Азкабану» 
(англ. «Harry Potter and the Prisoner of Azkaban») — третій роман серії 
«? Гаррі Поттер », написаний Дж. К. Роулінґ. 
Опублікований 8 липня 1999 року видавництвом «Блумсбері Паблішинґ» у Лондоні. 
У 1999 році отримав дві літературні премії: «Вайтбред (Коста)» і «Премію Брема Стокера», 
а також був номінований на кілька інших премій, внаслідок чого визнаний одним 
з найвидатніших творів у жанрі «фентезі» за останні роки. 
У 2004 році на основі роману знято однойменний художній фільм. 
Українською мовою роман перекладений Віктором Морозовим і опублікований видавництвом
«А-БА-БА-ГА-ЛА-МА-ГА» 10 травня 2002 року.','https://fantasy-worlds.net/lib/id4596/',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp3.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Books(BookId, Book_Name, Book_description,Book_url,Book_Image) 
SELECT 4,'Гаррі Поттер і келих вогню','«Га́ррі По́ттер і ке́лих вогню́» (англ. «Harry Potter and the Goblet of Fire») — 
четвертий роман серії «Гаррі Поттер», написаний Дж. К. Ролінґ. 
Опублікований 8 липня 2000 року видавництвом «Блумсбері Паблішинґ» у Лондоні. 
Вихід книги супроводжувався широкою рекламною кампанією і ажіотажем у колах читачів; 
цікавість аудиторії була, зокрема, стимульована попередженням авторки, 
що одного з персонажів буде вбито.
За обсягом «Келих вогню» значно перебільшує попередні частини серії. 
Обсяг наступних романів є більшим або приблизно дорівнює обсягові четвертого тому.','https://fantasy-worlds.net/lib/id4597/',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp4.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Books(BookId, Book_Name, Book_description,Book_url,Book_Image) 
SELECT 5,'Гаррі Поттер і Орден Фенікса','«Га́ррі По́ттер і О́рден Фе́нікса» 
(англ. «Harry Potter and the Order of the Phoenix») — 
п"ятий роман серії «Гаррі Поттер», написаний Дж. К. Роулінґ. Опублікований 21 червня 2003 року 
видавництвом «Блумсбері Паблішинґ» у Лондоні. Однойменний художній фільм вийшов у 2007 році.
Українською мовою роман перекладений Віктором Морозовим (за редакцією Олекси Негребецького та Івана Малковича). 
Опублікований видавництвом «А-БА-БА-ГА-ЛА-МА-ГА».','https://fantasy-worlds.net/lib/id15/',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp5.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Books(BookId, Book_Name, Book_description,Book_url,Book_Image) 
SELECT 6,'Гаррі Поттер і напівкровний Принц','«Га́ррі По́ттер і напівкро́вний Принц» (англ. «Harry Potter and the Half-Blood Prince») — 
шостий роман серії «Гаррі Поттер», написаний Дж. К. Ролінґ. Опублікований 16 липня 2005 року 
видавництвом «Блумсбері Паблішинґ» у Лондоні.
Протягом першої доби від моменту релізу книги було продано дев"ять 
мільйонів примірників. Цим було встановлено рекорд, перевершений тільки наступною книгою серії — 
«Гаррі Поттер і смертельні реліквії» у 2007 році.
Українською мовою роман перекладений Віктором Морозовим 
(за редакцією Олекси Негребецького та Івана Малковича) і опублікований видавництвом 
«А-ба-ба-га-ла-ма-га» 6 жовтня 2005 року.','https://fantasy-worlds.net/lib/id5/',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp6.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Books(BookId, Book_Name, Book_description,Book_url,Book_Image)  
SELECT 7,'Гаррі Поттер і смертельні реліквії','«Га́ррі По́ттер і Смерте́льні релі́квії» 
(англ. «Harry Potter and the Deathly Hallows») — сьомий роман серії «Гаррі Поттер», 
написаний Дж. К. Ролінґ. Опублікований 21 липня 2007 року видавництвом «Блумсбері Паблішинґ» у Лондоні.
Роман завершує серію, публікація якої тривала 10 років (1997—2007). 
Однак у 2015 році було оголошено про вихід нової, восьмої книги про Гаррі Поттера, 
Гаррі Поттер та Прокляте дитя.
Книгу було видано одночасно у 93 країнах світу. 
Протягом першої доби від момент релізу книги було продано одинадцять мільйонів примірників. 
Цим було встановлено рекорд, який тримала попередня частина серії — Гаррі Поттер і Напівкровний 
Принц — з 2005 року.
Українською мовою роман перекладений Віктором Морозовим 
(за редакцією Олекси Негребецького та Івана Малковича) і опублікований видавництвом 
«А-БА-БА-ГА-ЛА-МА-ГА» 25 вересня 2007 року — раніше за всі інші перекладені версії книги.','https://fantasy-worlds.net/lib/id4598/',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp7.jpg', Single_Blob) as image
