INSERT INTO Potters_Patrol.dbo.Movies(MovieId, Movie_Name, Movie_Description,Movie_Image) 
SELECT 1,'Гаррі Поттер і філософський камінь (Фільм)','«Га́ррі По́ттер і філосо́фський ка́мінь» (англ. Harry Potter and the Philosopher"s Stone) — перший із серії фільмів про хлопчика-чарівника Гаррі Поттера, 
екранізація однойменного роману Дж. К. Роулінг.
Фільм був знятий режисером Крісом Коламбусом (він працював і над другим фільмом серії). 
Головні ролі виконали 12-річні Деніел Редкліфф, Руперт Грінт та 11-річна Емма Вотсон. У багатьох дорослих ролях зняті провідні британські актори, 
такі як Меґґі Сміт, Алан Рікман, Джон Кліз та інші. Фільм був номінований на три премії «Оскар» в технічних номінаціях, але не виграв жодну з них. Його можна дивитися дітям будь-якого віку (Рейтинг G від MPAA).',BulkColumn
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp1-movie.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Movies(MovieId, Movie_Name, Movie_Description,Movie_Image) 
SELECT 2,'Гаррі Поттер і таємна кімната (Фільм)','«Га́ррі По́ттер і Тає́мна кімна́та» (англ. Harry Potter and the Chamber of Secrets) — другий фільм про пригоди хлопчика-чарівника Гаррі Поттера. 
Вийшов на екрани в 2002 році. Більша частина акторського складу і команди перейшла з попереднього фільму. 
У головних ролях знялися Деніел Редкліф, Емма Вотсон, Руперт Грінт. Кріс Коламбус вдруге посів пост режисера. Роль Дамблдора востаннє виконав Річард Гарріс.',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp2-movie.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Movies(MovieId, Movie_Name, Movie_Description,Movie_Image) 
SELECT 3,'Гаррі Поттер і в"язень Азкабану (Фільм)','«Гаррі Поттер і в"язень Азкабану» (англ. «Harry Potter and the Prisoner of Azkaban») — американо-британське фентезі 2004 року, 
третій фільм із серії про Гаррі Поттера, знятий режисером Альфонсо Куароном на основі однойменного роману Дж. К. Роулінг. 
Сценарій написав Стів Кловз, продюсером фільму виступив режисер двох попередніх фільмів Кріс Коламбус, Девід Гейман і Марк Редкліфф.
Виконавці головних ролей залишилися незмінними. Акторський склад другого плану поповнився відомими іменами: Гері Олдмен, Девід Тьюліс, Тімоті Сполл, Емма Томпсон і Майкл Гембон 
(замінив Річарда Гарріса у ролі Албуса Дамблдора).
Прем"єра відбулася 31 травня 2004 року у Великій Британії та 4 червня у Північній Америці. Фільм отримав дві номінації на Оскар. 
Попри найменші касові збори серед усіх стрічок франшизи, фільм отримав одні з найкращих відгуків кінокритиків і визнаний багатьма глядачами та критиками найкращим фільмом про Гаррі Поттера.',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp3-movie.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Movies(MovieId, Movie_Name, Movie_Description,Movie_Image) 
SELECT 4,'Гаррі Поттер і келих вогню (Фільм)','«Га́ррі По́ттер і Ке́лих Вогню́» (англ. Harry Potter and the Goblet of Fire) — британсько-американський фентезійний пригодницький фільм 2005 року режисера Майка Ньювела 
та дистриб"ютора Warner Bros. Pictures, четверта частина циклу фільмів про Гаррі Поттера, заснований на однойменному романі Дж. К. Ролінґ. Сценарій написав Стів Кловз, продюсером став Девід Гейман.
Головні ролі виконували: Деніел Редкліфф, Руперт Грінт, Емма Вотсон, Роббі Колтрейн, Рейф Файнс, Майкл Гембон, Брендан Глісон, Джейсон Айзекс, Гері Олдман, Алан Рікман, 
Меггі Сміт і Тімоті Сполл. Сюжет фільму розгортається навколо трьох головних героїв — Гаррі Поттера, Рона Візлі та Герміони Грейнджер; історія оповідає про четвертий рік навчання Гаррі в 
Гогвортсі, де він обирається Келихом Вогню для участі в Турнірі Трьох Чарівників. Фільм є продовженням «Гаррі Поттер і в"язень Азкабану», наступник — «Гаррі Поттер і Орден Фенікса».',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp4-movie.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Movies(MovieId, Movie_Name, Movie_Description,Movie_Image)  
SELECT 5,'Гаррі Поттер і Орден Фенікса (Фільм)','«Га́ррі По́ттер та О́рден Фе́нікса» (англ. Harry Potter and the Order of the Phoenix) — американо-британське фентезі, п"ятий фільм із серії про Гаррі Поттера, 
знятий режисером Девідом Єйтсом на основі однойменного роману Дж. К. Роулінг. Сценарій вперше писав не Стів Кловз, а Майкл Голденберг.
«Орден Фенікса» займає 38 місце у списку найкасовіших фільмів, отримав схвальні відгуки кінокритиків і касовий успіх.
Прем"єра фільму відбулася у Великій Британії 12 липня 2007 року та у США — 11 липня. В українському прокаті стрічка стартувала 19 липня 2007 року.',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp5-movie.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Movies(MovieId, Movie_Name, Movie_Description,Movie_Image) 
SELECT 6,'Гаррі Поттер і напівкровний Принц (Фільм)','«Га́ррі По́ттер і Напівкро́вний Принц» (англ. Harry Potter and the Half-Blood Prince) — 
американо-британське фентезі, шостий фільм із серії про Гаррі Поттера, знятий режисером Девідом Єйтсом на основі однойменного роману Дж. К. Роулінг. Сценарій написав Стів Кловз, 
продюсерами виступили Девід Баррон і Девід Гейман.
Світова прем"єра фільму відбулася 15 липня 2009 року. Разом із позитивними відгуками кіноритиків «Напівкровний принц» отримав касовий успіх, 
заробивши більше 934 мільйонів доларів загальних зборів. На сьогодні стрічка займає 39 місце у списку найкасовіших фільмів.',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp6-movie.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Movies(MovieId, Movie_Name, Movie_Description,Movie_Image) 
SELECT 7,'Гаррі Поттер і смертельні реліквії: частина перша (Фільм)','«Гаррі Поттер і Смертельні реліквії: Частина 1» (англ. Harry Potter and the Deathly Hallows – Part 1) — 
британо-американське фентезі 2010 року, зняте режисером Девідом Єйтсом за однойменним романом Дж. К. Роулінг. Це передостанній фільм серії, перша з двох частин екранізації 
книги «Гаррі Поттер і Смертельні реліквії». Сценарій стрічки написав Стів Кловз, продюсерські функції виконали Девід Гейман, Девід Баррон і Джоан Роулінг.
Зйомки фільму стартували 19 лютого 2009 року та завершились 12 червня 2010. Світова прем"єра стрічки відбулася 19 листопада 2010 року. 
В українських кінотеатрах «Смертельні реліквії: Частина 1» стартувала 18 листопада (у деяких містах — 17 грудня) того ж року.',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp7-movie.jpg', Single_Blob) as image
INSERT INTO Potters_Patrol.dbo.Movies(MovieId, Movie_Name, Movie_Description,Movie_Image)  
SELECT 8,'Гаррі Поттер і смертельні реліквії : частина друга (Фільм)','«Гаррі Поттер та Смертельні Реліквії: Частина 2» (англ. Harry Potter and the Deathly Hallows – Part 2) — 
британо-американське фентезі, зняте режисером Девідом Єйтсом, заключна частина серії фільмів про Гаррі Поттера та друга з двох частин екранізації роману «Гаррі Поттер і Смертельні реліквії» Джоан Роулінг. 
Сценарій написав Стів Кловз, продюсерами виступили Девід Баррон, Девід Гейман і Джоан Роулінг. На 6 липня 2020 року фільм займав 218-ту позицію у списку 250 найкращих фільмів за версією IMDb.
Прем"єра фільму відбувалася 13—15 липня 2011 року. Це єдиний фільм «Поттеріани», що вийшов у форматі 3D. 
Прокат в Україні стартував 13 липня. Стрічка отримала схвальні відгуки кінокритиків і побила ряд касових рекордів. Картина отримала три номінації на премію «Оскар».',BulkColumn 
FROM Openrowset( Bulk 'C:\Users\MSI\Desktop\PottersPatrol\ClientApp\src\images\Hp7.2-movie.jpg', Single_Blob) as image
